from dotenv import load_dotenv
import os

load_dotenv()

BOT_TOKEN = os.getenv("BOT_TOKEN")
ID_CHAT_ORDERS = int(os.getenv("ID_CHAT_ORDERS"))

name_store = "myStore"

menu = {
    "🛒Купити": {
        "🫐Samsung": {
            "A Серія": [
                "A05E", "A10", "A40", "A30", "A70", "A12"
            ],
            "S Серія": {
                "S20 Plus": ["128гб-5999₴"],
                "S21 Ultra": ["128гб-10999₴", "256гб-12499₴"],
                "S22 Ultra": ["256гб-15999₴"]
            }
        },
        "🍏iPhone": {
            "Bypass": {
                "iPhone 6": ["16гб-699₴", "32гб-799₴", "64гб-899₴"],
                "iPhone 6s": ["16гб-799₴", "32гб-899₴", "64гб-999₴"],
                "iPhone SE2016": ["16гб-699₴", "32гб-799₴", "64гб-899₴"],
                "iPhone 7": ["32гб-999₴", "128гб-1199₴"],
                "iPhone 8": ["64гб-1799₴", "256гб-2499₴"]
            },
            "Neverlock": {
                "iPhone 5": ["16гб-499₴", "32гб-599₴", "64гб-699₴"],
                "iPhone 5c": ["16гб-499₴", "32гб-599₴", "64гб-699₴"],
                "iPhone 5s": ["16гб-599₴", "32гб-699₴", "64гб-799₴"],
                "iPhone 6": ["16гб-799₴", "32гб-899₴", "64гб-999₴"],
                "iPhone 6s": ["16гб-899₴", "32гб-999₴", "64гб-1099₴", "128гб-1299₴"],
                "iPhone SE2016": ["16гб-799₴", "32гб-899₴", "64гб-999₴", "128гб-1199₴"],
                "iPhone 7": ["32гб-1199₴", "128гб-1499₴"],
                "iPhone 8": ["64гб-1999₴", "256гб-2999₴"],
                "iPhone X": ["64гб-3999₴", "256гб-4999₴"],
                "iPhone SE2020": ["64гб-3499₴", "128гб-4499₴"],
                "iPhone XR": ["64гб-4799₴", "128гб-5499₴"]
            }
        }
    },
    "🔓Розблокування iCloud": {
        "iPhone 6/6 Plus": [
            "Екранний Пароль - 400₴",
            "Блокування Активації - 300₴"
        ],
        "iPhone 6s/6s Plus": [
            "Екранний Пароль - 400₴",
            "Блокування Активації - 300₴"
        ],
        "iPhone SE2016": [
            "Екранний Пароль - 400₴",
            "Блокування Активації - 300₴"
        ],
        "iPhone 7/7 Plus": [
            "Екранний Пароль - 400₴",
            "Блокування Активації - 300₴"
        ],
        "iPhone 8/8 Plus": [
            "Екранний Пароль - 500₴",
            "Блокування Активації - 400₴"
        ],
        "iPhone X": [
            "Екранний Пароль - 500₴",
            "Блокування Активації - 400₴"
        ]
    }
}
